import React from "react";
import s from "./engagements.module.css";
import { cn } from "lib/utils";
import { WknSwiper } from "ui";
import { EngagementCard } from "common";

interface Props {
	className?: string;
}

export const Engagements: React.FC<Props> = ({ className }) => {
	return (
		<div className={cn(s.root, className)}>
			<div className={s.Container}>
				<div className={s.heading}>
					<h2 className={s.title}>محتوا های ما</h2>
				</div>
				<div className={s.sliderContainer}>
					<WknSwiper
						spaceBetween={20}
						slidesPerView={1.1}
						breakpoints={{
							992: {
								slidesPerView: 3,
							},
						}}
						className={s.slider}
						slideClassName={s.slide}
					>
						<EngagementCard
							bgColor="#FAF0E6"
							titleColor="#39281D"
							textColor="#39281D"
							bgImgSrc="/72cb4785626ef2139925de9e19d81a53.jpeg"
							icon={(props: any) => (
								<svg
									width="44"
									height="44"
									viewBox="0 0 44 44"
									fill="none"
									xmlns="http://www.w3.org/2000/svg"
									{...props}
								>
									<g id="clear_night">
										<path
											id="clear_night_2"
											d="M22.22 44C19.14 44 16.2525 43.4133 13.5575 42.24C10.8625 41.0667 8.51583 39.4808 6.5175 37.4825C4.51917 35.4842 2.93333 33.1375 1.76 30.4425C0.586667 27.7475 0 24.86 0 21.78C0 16.4267 1.705 11.7058 5.115 7.6175C8.525 3.52917 12.87 0.99 18.15 0C17.49 3.63 17.6917 7.1775 18.755 10.6425C19.8183 14.1075 21.6517 17.1417 24.255 19.745C26.8583 22.3483 29.8925 24.1817 33.3575 25.245C36.8225 26.3083 40.37 26.51 44 25.85C43.0467 31.13 40.5167 35.475 36.41 38.885C32.3033 42.295 27.5733 44 22.22 44Z"
											fill="currentcolor"
										/>
									</g>
								</svg>
							)}
							title="آشنایی با شیوه رُست قهوه"
							description="لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است..."
						/>
						<EngagementCard
							bgColor="#C33"
							titleColor="#FAF0E6"
							textColor="#FAF0E6"
							bgImgSrc="/a09d0a0870a60e969b084d75f283ac3f.jpeg"
							icon={(props: any) => (
								<svg
									width="44"
									height="44"
									viewBox="0 0 44 44"
									fill="none"
									xmlns="http://www.w3.org/2000/svg"
									{...props}
								>
									<path
										id="eco"
										d="M21.2992 43.9532C19.8793 43.9532 18.4486 43.7918 17.0071 43.4691C15.5657 43.1464 14.0919 42.6838 12.5859 42.0814C13.1023 36.8749 14.6083 32.0127 17.1039 27.4947C19.5996 22.9766 22.8053 18.9965 26.7209 15.5542C21.9877 17.9638 17.8892 21.1479 14.4254 25.1066C10.9616 29.0652 8.54121 33.5832 7.16429 38.6606C6.99218 38.5315 6.83082 38.3917 6.68022 38.2411L6.19614 37.757C4.17379 35.7347 2.63551 33.4757 1.58131 30.98C0.527102 28.4843 0 25.8811 0 23.1703C0 20.2443 0.580888 17.4474 1.74267 14.7797C2.90444 12.1119 4.51802 9.74529 6.5834 7.67991C10.0687 4.19458 14.5868 1.92481 20.1375 0.870608C25.6882 -0.183598 33.4764 -0.280412 43.5021 0.580163C44.2766 10.864 44.1475 18.706 43.1148 24.1061C42.0821 29.5063 39.8446 33.9275 36.4023 37.3698C34.2939 39.4782 31.9381 41.1025 29.3349 42.2428C26.7316 43.383 24.0531 43.9532 21.2992 43.9532Z"
										fill="currentcolor"
									/>
								</svg>
							)}
							title="تفاوت دان قهوه عربیکا و روبوستا؟"
							description="لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد..."
						/>
						<EngagementCard
							bgColor="#39281D"
							titleColor="#FAF0E6"
							textColor="#FAF0E6"
							bgImgSrc="/27e392c4f25b9b9951b6e18a829e0009.jpeg"
							icon={(props: any) => (
								<svg
									width="44"
									height="44"
									viewBox="0 0 44 44"
									fill="none"
									xmlns="http://www.w3.org/2000/svg"
									{...props}
								>
									<path
										id="light_mode"
										d="M22 32C19.2333 32 16.875 31.025 14.925 29.075C12.975 27.125 12 24.7667 12 22C12 19.2333 12.975 16.875 14.925 14.925C16.875 12.975 19.2333 12 22 12C24.7667 12 27.125 12.975 29.075 14.925C31.025 16.875 32 19.2333 32 22C32 24.7667 31.025 27.125 29.075 29.075C27.125 31.025 24.7667 32 22 32ZM8 23.5H0V20.5H8V23.5ZM44 23.5H36V20.5H44V23.5ZM20.5 8V0H23.5V8H20.5ZM20.5 44V36H23.5V44H20.5ZM11.1 13.1L6.1 8.25L8.25 6.05L13.05 11.05L11.1 13.1ZM35.8 37.9L30.9 32.9L32.95 30.85L37.9 35.75L35.8 37.9ZM30.85 11.05L35.75 6.1L37.95 8.2L33 13.1L30.85 11.05ZM6.1 35.75L11.05 30.85L13.15 32.95L8.25 37.9L6.1 35.75Z"
										fill="currentcolor"
									/>
								</svg>
							)}
							title="روش های دَم آوری"
							description="چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد..."
						/>
					</WknSwiper>
				</div>
			</div>
		</div>
	);
};
